ziteh/LEAP-upper-limb/test/stm32_hal_as5047p_test/include/main.h
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C"
{
#endif

#include "stm32f4xx_hal.h"

#include "printf.h"
#include "as5047p.h"

  void Error_Handler(void);

#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn

#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA

#define AS5047P_SCK_Pin GPIO_PIN_5
#define AS5047P_SCK_GPIO_Port GPIOA
#define AS5047P_MISO_Pin GPIO_PIN_6
#define AS5047P_MISO_GPIO_Port GPIOA
#define AS5047P_MOSI_Pin GPIO_PIN_7
#define AS5047P_MOSI_GPIO_Port GPIOA
#define AS5047P_SS_Pin GPIO_PIN_6
#define AS5047P_SS_GPIO_Port GPIOB

#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
